{
    "basic_info": {
                "firstname": "Keaton",
                "lastname": "Guderian"
              },


      "contact": {
                "email": "keagud@protonmail.com",
                "phone": "(206)-321-2181"
            },
            "links": {
                "github": "https://github.com/keagud",
                "website": "https://implicit.computer"
            },

    "education": {
        "degrees": [
            {
                "name": "Bachelor of Arts, Linguistics",
                "relevent_courses": [
                    {
                        "name": "Syntax I-II",
                        "description": "Theory and analysis of both natural and formal language systems"
                    },
                    {
                        "name": "Intro to Computational Linguistics",
                        "description": "Survey of natural language processing methods including deterministic, Baysian, and machine learning paradigms, with accompanying practical experience with Python."
                    }
                ]
            },
            {
                "name": "Bachelor of Science, Speech and Hearing Science"
            }
        ],
        "overall": {
            "achievements": [
                "Graduated Cum Laude",
                "Made the Dean's List for every term that met the credit requirement (all but 2)"
            ],
            "gpa": 3.88,
            "school": "University of Washington, Seattle",
            "year_end": 2020,
            "year_start": 2016
        }
    },
    "skills": {
        "programming_languages": {
            "proficient": [
                "Python",
                "C",
                "C++",
                "Javascript/Typescript",
                "HTML/CSS"
            ],
            "learning": [
                "Rust",
                "Java",
                "Scala"
            ]
        },
        "other": [
            "Linux user for all personal computing needs for the past 7 years, adept in most common command line utilities in the Linux/Unix environment (bash/zsh, sed, grep, ssh, vim...), as well as the Unix filesystem architecture and API",
            "Experienced with the use of version control with Git"
        ]
    },
    "projects": [
        {
            "name": "Della",
            "tech_keywords": [
                "Python"
            ],
            "link": "https://github.com/keagud/della",
            "bullet_points": [
                "A personal orginizer similar to TaskWarrior, with the added feature of natural language processing to allow todos to be managed with a simple, naturalistic command syntax, e.g. \"pick up Dave at the airport a week from this Wednesday.\" ",
                "Users can interact with and view their upcoming tasks either from the command line, or from a formatted prompt featuring full syntax highlighting. Tasks can be set to sync to a server for access from multiple devices.",
                "Written in pure Python; remote syncing is handled over SSH via the Paramiko library"
            ],
            "show": true
        },
        {
            "name": "Quackbot",
            "tech_keywords": [
                "Javascript",
                "Typescript",
                "Node.js"
            ],
            "link": "https://github.com/keagud/quackbot",
            "bullet_points": [
                "A Discord bot with a modular design, allowing features and commands to be easily swapped out. Current functionality includes: fortune telling with a simulated Tarot deck, generation of images based on a macro, user search of Wikipedia. ",
                "Written in Typescript and Javascript using Node.js and npm. Hosted on Google Cloud, with building and deployment fully automated using a Github Actions CI/CD workflow script"
            ],
            "show": true
        },
        {
            "name": "Linelog",
            "tech_keywords": [
                "Python",
                "Git"
            ],
            "link": "https://github.com/keagud/linelog",
            "bullet_points": [
                "A development productivity tool that calculates the number of lines of code commited in Git by a given user, over a given interval of time, and displays the results as a curses-style graph on the command line broken down by language. Definitions for what should count as a \"line\" are fully customizable for each filetype."
            ],
            "show": true
        },
        {
            "name": "Dateparse",
            "tech_keywords": [
                "Python"
            ],
            "link": "https://github.com/keagud/dateparse",
            "bullet_points": [
                "A pure Python, dependency-free library for parsing natural language expressions about time, like \"two weeks ago\", \"a week before Christmas\", \"in four months\" into Python date objects. "
            ],
            "show": false
        }
    ],
    "experience": [ {
        "company_name": "Ikolith Recreations",
        "job_title": "Technical Consultant",
        "year_start": 2020,
        "year_end": 2022,
        "general_description": "Technical and creative work with a local Seattle-based independent tabletop game studio.",
        "bullet_points": [
            "Wrote and managed utility scripts, mostly in Python and bash, to automate workflow tasks such as document formatting.",
            "Developed an automated pipeline to convert and compile Markdown documentation into Latex for publication. Created a program to partially simulate the evolution of a fictional language over time as a worldbuilding and writing aid"
        ]
    }
    ],
    "hobbies": [
        " Ancient languages (Latin, Attic Greek)",
        "Ancient languages   (Lisp, C89, Ada) ",
        "Constructed Languages",
        "Distance running, cycling"
    ]
}
